videos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Some Emacs videos</title>
<!-- 2014-04-30 Wed 18:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Sacha Chua" />
<link rel="stylesheet" type="text/css" href="./css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="./css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="./css/style.css"></link>
<link rel="stylesheet" type="text/css" href="./css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Some Emacs videos</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introductory tutorials/demos</a>
<ul>
<li><a href="#sec-1-1">Emacs: Introductory Tutorial (gaylerdaniel)</a></li>
<li><a href="#sec-1-2">Emacs in 10 minutes! (zaychenok)</a></li>
<li><a href="#sec-1-3">Short Demo of Emacs / Aquamacs (Rob Rohan)</a></li>
<li><a href="#sec-1-4">Programming Tutorials (1 of 4): Setting up Emacs (snietfeld)</a></li>
<li><a href="#sec-1-5">Working with OS X and Emacs by Ryan McGeary (Ryan McGeary·)</a></li>
<li><a href="#sec-1-6">RT 2011: Screencast 01 - emacs keyboard introduction (Kurt Schwehr)</a></li>
<li><a href="#sec-1-7">Using emacs (more) efficiently (than vim). (Paul Ozog)</a></li>
<li><a href="#sec-1-8">Emacs Tutorial Lesson 1 (AlexW573)</a></li>
<li><a href="#sec-1-9">Hack Emacs</a>
<ul>
<li><a href="#sec-1-9-1">Hack Emacs - Introduction to Hack Emacs (Rick Dillon)</a></li>
<li><a href="#sec-1-9-2">Hack Emacs - A Technical Introduction to GNU Emacs (Rick Dillon)</a></li>
<li><a href="#sec-1-9-3">Hack Emacs - Working with Windows and Frames (Rick Dillon)</a></li>
<li><a href="#sec-1-9-4">Hack Emacs - Working with Buffers (Rick Dillon)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">Feature demonstrations</a>
<ul>
<li><a href="#sec-2-1">Auto Complete Mode for GNU Emacs (m2ym)</a></li>
<li><a href="#sec-2-2">Emacs as a Python IDE (justafoo42)</a></li>
<li><a href="#sec-2-3">YASnippet screencast (sqrtkid)</a></li>
<li><a href="#sec-2-4">Flymake in GNU Emacs 22 (BitToByte)</a></li>
<li><a href="#sec-2-5">Org</a>
<ul>
<li><a href="#sec-2-5-1">Hack Emacs - An Overview of Org Mode (Rick Dillon)</a></li>
<li><a href="#sec-2-5-2">Emacs Org-mode - a system for note-taking and project planning (GoogleTechTalks)</a></li>
<li><a href="#sec-2-5-3">Writing PPT with org-mode and beamer in Emacs (dimilarzhu)</a></li>
<li><a href="#sec-2-5-4">Emacs Power: Can your editor do THIS!  (mina86)</a></li>
</ul>
</li>
<li><a href="#sec-2-6">Using gdb within emacs (Aditya Bankar)</a></li>
<li><a href="#sec-2-7">GNEVE - GNU Emacs Video Editor mode demo (arnmatyasi)</a></li>
<li><a href="#sec-2-8">emacs text editor (Maciej Kaminski)</a></li>
<li><a href="#sec-2-9">Emacs with HTML, Zencoding and YASnippet (Christopher Done)</a></li>
<li><a href="#sec-2-10">Emacs Rocks</a>
<ul>
<li><a href="#sec-2-10-1">Emacs Rocks! Episode 01: From var to this (emacsrocks)</a></li>
<li><a href="#sec-2-10-2">Emacs Rocks! Episode 14: Paredit (emacsrocks)</a></li>
<li><a href="#sec-2-10-3">Emacs Rocks! Episode 11: swank-js (emacsrocks)</a></li>
<li><a href="#sec-2-10-4">Emacs Rocks! Episode 13: multiple-cursors (emacsrocks)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">Other</a>
<ul>
<li><a href="#sec-3-1">XKCD@MIT: On Emacs vs Vi (Laura Boylan)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Text taken from video descriptions
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introductory tutorials/demos</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Emacs: Introductory Tutorial (gaylerdaniel)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://www.youtube.com/watch?v=PldhTEu1VRo">https://www.youtube.com/watch?v=PldhTEu1VRo</a>
</p>

<p>
An simple introductory tutorial on how to open and close Emacs, open and save files, open multiple buffers in a single window, search within files, open a shell in Emacs, and open a Man page in Emacs
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Emacs in 10 minutes! (zaychenok)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="https://www.youtube.com/watch?v=K3_SFerNIeI">https://www.youtube.com/watch?v=K3_SFerNIeI</a>
</p>

<p>
A basic introduction to one of the more popular programming editors. Yes, I know I went fast - sorry. I'll make a longer tutorial at some point. This was more of a feature-overview type style. And I only had time for the basic features.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Short Demo of Emacs / Aquamacs (Rob Rohan)</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<a href="https://www.youtube.com/watch?v=k1dKFpGwKZ4">https://www.youtube.com/watch?v=k1dKFpGwKZ4</a> 
</p>

<p>
Short movie to show some of my favorite features of emacs and aquamacs (A Mac port of emacs). This doesn't show how to do anything specific in emacs, just a few modes and techniques that I find very helpful and unique to emacs
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Programming Tutorials (1 of 4): Setting up Emacs (snietfeld)</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<a href="https://www.youtube.com/watch?v=yvSCIl0Jh5A">https://www.youtube.com/watch?v=yvSCIl0Jh5A</a>
</p>

<p>
A quick tutorial on getting emacs installed and a few user preferences set.
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Working with OS X and Emacs by Ryan McGeary (Ryan McGeary·)</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<a href="https://www.youtube.com/watch?v=a">https://www.youtube.com/watch?v=a</a>
</p>

<p>
Ryan McGeary demonstrates how he works with Mac OS X and his editor of choice, Emacs. Ryan runs his own software consultancy called McGeary Consulting Group. He
 specializes in web application development and offers a wide range of services including development, mentoring, and business advice.
</p>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">RT 2011: Screencast 01 - emacs keyboard introduction (Kurt Schwehr)</h3>
<div class="outline-text-3" id="text-1-6">
<p>
<a href="https://www.youtube.com/watch?v=16Rd46SE">https://www.youtube.com/watch?v=16Rd46SE</a>
</p>

<p>
The first video for the 2011 Research Tools (ESCI 895-03) at the University of New Hampshire in the Center for Coastal and Ocean Mapping (CCOM). The goal of this
 video is introduce you to using just the keyboard for working inside the GNU Emacs text editor. This video goes along with lectures 7 and 8.
</p>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">Using emacs (more) efficiently (than vim). (Paul Ozog)</h3>
<div class="outline-text-3" id="text-1-7">
<p>
<a href="https://www.youtube.com/watch?v=lHshNewGrY4">https://www.youtube.com/watch?v=lHshNewGrY4</a>
</p>

<p>
I've always liked seeing other people's workflow - so maybe this video will inspire some pimple-faced German kid out there to more effectively use emacs.
</p>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">Emacs Tutorial Lesson 1 (AlexW573)</h3>
<div class="outline-text-3" id="text-1-8">
<p>
<a href="https://www.youtube.com/watch?v=G7Mxka1ej0A">https://www.youtube.com/watch?v=G7Mxka1ej0A</a>
</p>

<p>
Covers C-x C-f, C-x C-s, C-x C-c, C-g (load file, save file, quit, cancel command). Meant to be a very short lesson to teach the essentials of Emacs.
</p>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9">Hack Emacs</h3>
<div class="outline-text-3" id="text-1-9">
</div><div id="outline-container-sec-1-9-1" class="outline-4">
<h4 id="sec-1-9-1">Hack Emacs - Introduction to Hack Emacs (Rick Dillon)</h4>
<div class="outline-text-4" id="text-1-9-1">
<p>
<a href="https://www.youtube.com/watch?v=VpFK6abGCOg">https://www.youtube.com/watch?v=VpFK6abGCOg</a>
</p>

<p>
This is a brief introduction to GNU Emacs and a description of some topics I'd like to cover in the "Hack Emacs" series. 
</p>
</div>
</div>

<div id="outline-container-sec-1-9-2" class="outline-4">
<h4 id="sec-1-9-2">Hack Emacs - A Technical Introduction to GNU Emacs (Rick Dillon)</h4>
<div class="outline-text-4" id="text-1-9-2">
<p>
<a href="https://www.youtube.com/watch?v=BwTMzYo84Ao">https://www.youtube.com/watch?v=BwTMzYo84Ao</a>
</p>

<p>
We do a brief analysis on the source code of Emacs, and look at some of the basic mechanisms to navigate to Emacs functions and variables from within the editor
 itself.
</p>
</div>
</div>
<div id="outline-container-sec-1-9-3" class="outline-4">
<h4 id="sec-1-9-3">Hack Emacs - Working with Windows and Frames (Rick Dillon)</h4>
<div class="outline-text-4" id="text-1-9-3">
<p>
<a href="https://www.youtube.com/watch?v=aIMECr7K35Q">https://www.youtube.com/watch?v=aIMECr7K35Q</a>
</p>

<p>
Understanding and working with windows and frames in GNU Emacs.
</p>
</div>
</div>

<div id="outline-container-sec-1-9-4" class="outline-4">
<h4 id="sec-1-9-4">Hack Emacs - Working with Buffers (Rick Dillon)</h4>
<div class="outline-text-4" id="text-1-9-4">
<p>
<a href="https://www.youtube.com/watch?v=YAIZvpSOlAs">https://www.youtube.com/watch?v=YAIZvpSOlAs</a>
</p>

<p>
Understanding and working with buffers in GNU Emacs.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Feature demonstrations</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Auto Complete Mode for GNU Emacs (m2ym)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://www.youtube.com/watch?v=rGVVnDxwJYE">https://www.youtube.com/watch?v=rGVVnDxwJYE</a>
</p>

<p>
A demo movie for auto-complete-mode v1.2 (aka auto-complete.el).
</p>

<p>
<a href="http://cx4a.org/software/auto-complete/">http://cx4a.org/software/auto-complete/</a>
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Emacs as a Python IDE (justafoo42)</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="https://www.youtube.com/watch?v=OMi-uN-6O1Q">https://www.youtube.com/watch?v=OMi-uN-6O1Q</a> 
</p>

<p>
using rope
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">YASnippet screencast (sqrtkid)</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<a href="https://www.youtube.com/watch?v=vOj7btx3ATg">https://www.youtube.com/watch?v=vOj7btx3ATg</a>
</p>

<p>
YASnippet(Yet Another Snippet for Emacs) is a snippet extension for Emacs. 
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Flymake in GNU Emacs 22 (BitToByte)</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<a href="https://www.youtube.com/watch?v=F5Cc2W6PbL8">https://www.youtube.com/watch?v=F5Cc2W6PbL8</a>
</p>

<p>
demonstaration of flymake-mode, a new feature of GNU Emacs 22. It's a on-the-fly syntax checker."
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">Org</h3>
<div class="outline-text-3" id="text-2-5">
</div><div id="outline-container-sec-2-5-1" class="outline-4">
<h4 id="sec-2-5-1">Hack Emacs - An Overview of Org Mode (Rick Dillon)</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
<a href="https://www.youtube.com/watch?v=6W82EdwQhxU">https://www.youtube.com/watch?v=6W82EdwQhxU</a>
</p>

<p>
I take a high level look at Org Mode, an entire application written for Emacs that deals with data capture and organization through structural editing.
</p>
</div>
</div>

<div id="outline-container-sec-2-5-2" class="outline-4">
<h4 id="sec-2-5-2">Emacs Org-mode - a system for note-taking and project planning (GoogleTechTalks)</h4>
<div class="outline-text-4" id="text-2-5-2">
<p>
<a href="https://www.youtube.com/watch?v=oJTwQvgfgMM">https://www.youtube.com/watch?v=oJTwQvgfgMM</a> 
</p>

<p>
Org-mode is a large Emacs sub-systems that has been integrated into Emacs with the version 22.1 release. From its original intention,
Org-mode is a system for structured note-taking and project planning. It uses strictly plain text files, making it a truly portable, system-independent solution. The project-planning features are implemented using a fairly simple outlining paradigm, upon which meta-data concepts like due dates, priorities, TODO states and tags are overlayed in a non-intrusive way. Besides outlining the system and its basic concepts, I will give background information into the history of Org-mode and discuss the properties of such an evolved system compared to a top-down designed one. Finally, I will also briefly touch on some technical aspects that may be interesting for Emacs wizards and developers.
</p>
</div>
</div>

<div id="outline-container-sec-2-5-3" class="outline-4">
<h4 id="sec-2-5-3">Writing PPT with org-mode and beamer in Emacs (dimilarzhu)</h4>
<div class="outline-text-4" id="text-2-5-3">
<p>
<a href="https://www.youtube.com/watch?v=Ho6nMWGtepY">https://www.youtube.com/watch?v=Ho6nMWGtepY</a>
</p>

<p>
Writing PPT with org-mode and beamer in Emacs.
</p>
</div>
</div>
<div id="outline-container-sec-2-5-4" class="outline-4">
<h4 id="sec-2-5-4">Emacs Power: Can your editor do THIS!  (mina86)</h4>
<div class="outline-text-4" id="text-2-5-4">
<p>
<a href="https://www.youtube.com/watch?v=EQAd41VAXWo">https://www.youtube.com/watch?v=EQAd41VAXWo</a> 
</p>

<p>
Emacs with orgtbl mode used to create a HTML table. Creating HTML tables by hand can be painful, however thanks to orgtbl mode (which comes with org mode) Emacs users can edit tables in friendly way and later "send" (as org mode calls it) the data into a HTML source code. Inserting new columns and rearranging them is a single key binding!
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6">Using gdb within emacs (Aditya Bankar)</h3>
<div class="outline-text-3" id="text-2-6">
<p>
<a href="https://www.youtube.com/watch?v=vHOzMOzzxDA">https://www.youtube.com/watch?v=vHOzMOzzxDA</a>
</p>

<p>
This video explains how to use gdb within emacs. So you can debug your code using graphical tools instead of character commands. (This video has been made on Ubuntu
 8.04 using recordmydesktop.)
</p>
</div>
</div>
<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7">GNEVE - GNU Emacs Video Editor mode demo (arnmatyasi)</h3>
<div class="outline-text-3" id="text-2-7">
<p>
<a href="https://www.youtube.com/watch?v=0vumR5Hcz7s">https://www.youtube.com/watch?v=0vumR5Hcz7s</a>
</p>

<p>
"GNEVE - GNU Emacs Video Editor mode demo
</p>

<p>
Demonstration video on GNEVE in action.
"
</p>
</div>
</div>
<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8">emacs text editor (Maciej Kaminski)</h3>
<div class="outline-text-3" id="text-2-8">
<p>
<a href="https://www.youtube.com/watch?v=C0qblk1BQrI">https://www.youtube.com/watch?v=C0qblk1BQrI</a>
</p>

<p>
c++ mode for emacs text editor
</p>
</div>
</div>

<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9">Emacs with HTML, Zencoding and YASnippet (Christopher Done)</h3>
<div class="outline-text-3" id="text-2-9">
<p>
<a href="https://www.youtube.com/watch?v=u2r8JfJJgy8">https://www.youtube.com/watch?v=u2r8JfJJgy8</a>
</p>

<p>
Just a cruddy demonstration. I may get some real code to demonstrate it in action. 
</p>
</div>
</div>

<div id="outline-container-sec-2-10" class="outline-3">
<h3 id="sec-2-10">Emacs Rocks</h3>
<div class="outline-text-3" id="text-2-10">
</div><div id="outline-container-sec-2-10-1" class="outline-4">
<h4 id="sec-2-10-1">Emacs Rocks! Episode 01: From var to this (emacsrocks)</h4>
<div class="outline-text-4" id="text-2-10-1">
<p>
<a href="https://www.youtube.com/watch?v=O0UgY">https://www.youtube.com/watch?v=O0UgY</a>
</p>

<p>
<a href="http://emacsrocks.com">http://emacsrocks.com</a> - Rocking emacs tricks and tips screencast.
</p>
</div>
</div>

<div id="outline-container-sec-2-10-2" class="outline-4">
<h4 id="sec-2-10-2">Emacs Rocks! Episode 14: Paredit (emacsrocks)</h4>
<div class="outline-text-4" id="text-2-10-2">
<p>
<a href="https://www.youtube.com/watch?v=D6h5dFyyUX0">https://www.youtube.com/watch?v=D6h5dFyyUX0</a>
</p>

<p>
<a href="http://emacsrocks.com">http://emacsrocks.com</a> - Rocking emacs tricks and tips screencast.
</p>
</div>
</div>

<div id="outline-container-sec-2-10-3" class="outline-4">
<h4 id="sec-2-10-3">Emacs Rocks! Episode 11: swank-js (emacsrocks)</h4>
<div class="outline-text-4" id="text-2-10-3">
<p>
<a href="https://www.youtube.com/watch?v=qwtVtcQQfqc">https://www.youtube.com/watch?v=qwtVtcQQfqc</a>
</p>

<p>
<a href="http://emacsrocks.com">http://emacsrocks.com</a> - Rocking emacs tricks and tips screencast.
</p>
</div>
</div>

<div id="outline-container-sec-2-10-4" class="outline-4">
<h4 id="sec-2-10-4">Emacs Rocks! Episode 13: multiple-cursors (emacsrocks)</h4>
<div class="outline-text-4" id="text-2-10-4">
<p>
<a href="https://www.youtube.com/watch?v=jNa3axo40qM">https://www.youtube.com/watch?v=jNa3axo40qM</a>
</p>

<p>
<a href="http://emacsrocks.com">http://emacsrocks.com</a> - Rocking emacs tricks and tips screencast.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Other</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">XKCD@MIT: On Emacs vs Vi (Laura Boylan)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<a href="https://www.youtube.com/watch?v=k9RsByTnHFQ">https://www.youtube.com/watch?v=k9RsByTnHFQ</a>
</p>

<p>
Emacs vs. Vi, and making changes to comics once they have been posted.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
